sdlylshl/gprs_m22/src/msp430x14x头文件说明.h
/********************************************************************
*
* Standard register and bit definitions for the Texas Instruments
* MSP430 microcontroller.
*
* This file supports assembler and C development for
* MSP430x14x devices.
*
* Texas Instruments, Version 1.5
*
* Rev. 1.2, Additional Timer B bit definitions.
*           Renamed XTOFF to XT2OFF.
*
* Rev. 1.3, Removed leading 0 to aviod interpretation as octal
*            values under C
*           Included <In430.h> rather than "In430.h"
*
* Rev. 1.4, Corrected LPMx_EXIT to reference new intrinsic _BIC_SR_IRQ
*           Changed TAIV and TBIV to be read-only
*
* Rev. 1.5, Enclose all #define statements with parentheses
*
********************************************************************/

#ifndef __msp430x14x
#define __msp430x14x

/************************************************************
* STANDARD BITS,标准的位定义
************************************************************/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)

/************************************************************
* STATUS REGISTER BITS
************************************************************/
/*状态寄存器的每个位定义*/
#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)  /*各个状态位*/
#define GIE                 (0x0008)  /*通用中断允许位*/
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#ifndef __IAR_SYSTEMS_ICC /* Begin #defines for assembler *//*在汇编下的定义*/
#define LPM0                (CPUOFF)                   /*低功耗模式0*/
#define LPM1                (SCG0+CPUOFF)              /*低功耗模式1*/
#define LPM2                (SCG1+CPUOFF)              /*低功耗模式2*/
#define LPM3                (SCG1+SCG0+CPUOFF)         /*低功耗模式3*/
#define LPM4                (SCG1+SCG0+OSCOFF+CPUOFF)  /*低功耗模式4*/
/* End #defines for assembler */

#else /* Begin #defines for C */                           /*在C语言下的定义*/
#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)

#include <In430.h>

#define LPM0      _BIS_SR(LPM0_bits)     /* Enter Low Power Mode 0 */
#define LPM0_EXIT _BIC_SR_IRQ(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      _BIS_SR(LPM1_bits)     /* Enter Low Power Mode 1 */
#define LPM1_EXIT _BIC_SR_IRQ(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      _BIS_SR(LPM2_bits)     /* Enter Low Power Mode 2 */
#define LPM2_EXIT _BIC_SR_IRQ(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      _BIS_SR(LPM3_bits)     /* Enter Low Power Mode 3 */
#define LPM3_EXIT _BIC_SR_IRQ(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      _BIS_SR(LPM4_bits)     /* Enter Low Power Mode 4 */
#define LPM4_EXIT _BIC_SR_IRQ(LPM4_bits) /* Exit Low Power Mode 4 */
#endif /* End #defines for C */

/************************************************************
* PERIPHERAL FILE MAP
************************************************************/

/************************************************************
* SPECIAL FUNCTION REGISTER ADDRESSES + CONTROL BITS
  特殊功能寄存器地址，控制bits
************************************************************/

#define IE1_                 (0x0000)     /* Interrupt Enable 1 */
sfrb    IE1               = IE1_;         /*中断允许寄存器1*/
#define WDTIE               (0x01)  /*WDT允许，选看门狗模式时无效*/
#define OFIE                (0x02)  /*振荡器故障中断允许*/
#define NMIIE               (0x10)  /*NMI中断允许*/
#define ACCVIE              (0x20)  /*FLASH存储器非法访问中断允许*/
#define URXIE0              (0x40)  /*URSART0接受中断允许*/
#define UTXIE0              (0x80)  /*URSART0发送中断允许*/

#define IFG1_               (0x0002)     /* Interrupt Flag 1 */
sfrb    IFG1              = IFG1_;       /*中断标志寄存器1*/
#define WDTIFG              (0x01)  /*看门狗模式时溢出或密匙不符合时置位*/
#define OFIFG               (0x02)  /*振荡器失效时置位*/
#define NMIIFG              (0x10)  /*RST/NMI引脚信号*/
#define URXIFG0             (0x40)  /*USART0接收标志*/
#define UTXIFG0             (0x80)  /*USART0发送标志*/

#define ME1_                (0x0004)     /* Module Enable 1 */
sfrb    ME1               = ME1_;        /*模块允许寄存器1*/
#define URXE0               (0x40)  /*USART0接收允许（UART模式）*/
#define USPIE0              (0x40)  /*USART0发送与接收允许（SPI模式）*/
#define UTXE0               (0x80)  /*USART0发送允许（UART模式）*/

#define IE2_                (0x0001)     /* Interrupt Enable 2 */
sfrb    IE2               = IE2_;        /*中断允许寄存器2*/
#define URXIE1              (0x10)  /*USART1接收中断允许*/
#define UTXIE1              (0x20)  /*USART1发送中断允许*/

#define IFG2_               (0x0003)     /* Interrupt Flag 2 */
sfrb    IFG2              = IFG2_;       /*中断标志寄存器*/
#define URXIFG1             (0x10)  /*USART1接收标志*/
#define UTXIFG1             (0x20)  /*USART1发送标志*/

#define ME2_                (0x0005)     /* Module Enable 2 */
sfrb    ME2               = ME2_;        /*模块允许寄存器2*/
#define URXE1               (0x10)  /*USART1接收允许（UART模式）*/
#define USPIE1              (0x10)  /*USART1发送与接收允许（SPI模式）*/
#define UTXE1               (0x20)  /*USART1发送允许（UART模式）*/

/************************************************************
* WATCHDOG TIMER 看们狗的定时器
************************************************************/

