sdlylshl/gprs_m22/src/msp430x14x头文件说明.h
#define P4IN_               (0x001C)  /* Port 4 Input */
const sfrb P4IN           = P4IN_;
#define P4OUT_              (0x001D)  /* Port 4 Output */
sfrb    P4OUT             = P4OUT_;
#define P4DIR_              (0x001E)  /* Port 4 Direction */
sfrb    P4DIR             = P4DIR_;
#define P4SEL_              (0x001F)  /* Port 4 Selection */
sfrb    P4SEL             = P4SEL_;

/************************************************************
* DIGITAL I/O Port5/6  输入输出端口I/O 5，6
************************************************************/

#define P5IN_               (0x0030)  /* Port 5 Input */
const sfrb P5IN           = P5IN_;
#define P5OUT_              (0x0031)  /* Port 5 Output */
sfrb    P5OUT             = P5OUT_;
#define P5DIR_              (0x0032)  /* Port 5 Direction */
sfrb    P5DIR             = P5DIR_;
#define P5SEL_              (0x0033)  /* Port 5 Selection */
sfrb    P5SEL             = P5SEL_;

#define P6IN_               (0x0034)  /* Port 6 Input */
const sfrb P6IN           = P6IN_;
#define P6OUT_              (0x0035)  /* Port 6 Output */
sfrb    P6OUT             = P6OUT_;
#define P6DIR_              (0x0036)  /* Port 6 Direction */
sfrb    P6DIR             = P6DIR_;
#define P6SEL_              (0x0037)  /* Port 6 Selection */
sfrb    P6SEL             = P6SEL_;

/************************************************************
* USART  USART通信模块
************************************************************/
/* UCTL，USART控制寄存器UCTL */
#define PENA                (0x80) /*校验允许位*/
#define PEV                 (0x40) /*奇偶校验位*/
#define SPB                 (0x20) /*停止位数，为0则1位停止位，为1，2位停止位 to distinguish from stackpointer SP */
#define CHAR                (0x10) /*字符长度，CHAR=0，7位，CHAR=1，8位*/
#define LISTEN              (0x08) /*是否将发送的数据由内部反馈给接收器，LISTEN=0，无反馈*/
#define SYNC                (0x04) /*模块功能选择，SYNC=0，UART模式，SYNC=1，SPI模式*/
#define MM                  (0x02) /*多机模式，MM=0，线路空闲多机协议，MM=1，地址位多机协议*/
#define SWRST               (0x01) /*系统复位后，只有对SWRST复位，USART才能从新被允许*/
/* UTCTL 发送控制寄存器UTCTL*/
#define CKPH                (0x80) /**/
#define CKPL                (0x40) /*时钟极性，CKPL=0，UCLKI信号与UCLK级性相同，为1则相反*/
#define SSEL1               (0x20) /*时钟源选择，确定用于波特率发生器的时钟源*/
#define SSEL0               (0x10) /*SSEL1，0     0--外部时钟UCLKI，1--辅助时钟ACLK，2，3---系统主时钟SMCLK*/
#define URXSE               (0x08) /*能在中断服务程序中启动微控制器时钟系统*/
#define TXWAKE              (0x04) /*控制多处理机通信模式的发送特性*/
#define STC                 (0x02)
#define TXEPT               (0x01) /*发送器空标志，在发送移位寄存器和UTXBUF空时置位，当数据写入UTXBUF时复位，也在SWRST置位时置位*/
/* URCTL 接收控制寄存器URCTL */
#define FE                  (0x80) /*当一个接收字符的停止位为0并被装入接收缓存时，帧错标志置位，FE用SWRST，PUC，URXBUF来复位*/
#define PE                  (0x40) /*当一个接收字符中的1的个数和它的校验位不符合被装入接收缓存时，校验错标志PE置位*/
#define OE                  (0x20) /*当一个字符写入URXBUF时前一个字符还未被读出，则溢出标志OE置位*/
#define BRK                 (0x10) /*当一次打断发生并且URXEIE置位，打断检测位BRK置位，只有通过SWRST，系统复位和读取URXBUF来复位*/
#define URXEIE              (0x08) /*接收出错字符中断允许位，URXEIE=0，接收的出错字符不改变URXIFG位，反之，根据URXWIE位的设置，任何字符都可使URXIFG置位*/
#define URXWIE              (0x04) /*接收唤醒中断允许位，为0：每一个接收的字符都能使URXIFG置位，为1：只有地址字符才能使URXIFG置位*/
#define RXWAKE              (0x02) /*接收唤醒检测RXWAKE位，当接收的字符是一地址字符且被送入接收缓存，置位*/
#define RXERR               (0x01) /*接收错误位RXERR置位表明有一个或多个出错标志（FE，PE，OE，BRK）置位*/

/************************************************************
* USART 0  通信模块0
************************************************************/

#define U0CTL_              (0x0070)  /* UART 0 Control */
sfrb    U0CTL             = U0CTL_;
#define U0TCTL_             (0x0071)  /* UART 0 Transmit Control */
sfrb    U0TCTL            = U0TCTL_;
#define U0RCTL_             (0x0072)  /* UART 0 Receive Control */
sfrb    U0RCTL            = U0RCTL_;
#define U0MCTL_             (0x0073)  /* UART 0 Modulation Control */
sfrb    U0MCTL            = U0MCTL_;
#define U0BR0_              (0x0074)  /* UART 0 Baud Rate 0 */
sfrb    U0BR0             = U0BR0_;
#define U0BR1_              (0x0075)  /* UART 0 Baud Rate 1 */
sfrb    U0BR1             = U0BR1_;
#define U0RXBUF_            (0x0076)  /* UART 0 Receive Buffer */
const sfrb U0RXBUF        = U0RXBUF_;
#define U0TXBUF_            (0x0077)  /* UART 0 Transmit Buffer */
sfrb    U0TXBUF           = U0TXBUF_;

/* Alternate register names */
/*寄存器的名字*/
#define UCTL0_              (0x0070)  /* UART 0 Control UART0控制寄存器*/
sfrb    UCTL0             = UCTL0_;
#define UTCTL0_             (0x0071)  /* UART 0 Transmit Control发送控制寄存器 */
sfrb    UTCTL0            = UTCTL0_;
#define URCTL0_             (0x0072)  /* UART 0 Receive Control接收控制寄存器 */
sfrb    URCTL0            = URCTL0_;
#define UMCTL0_             (0x0073)  /* UART 0 Modulation Control调整控制寄存器 */
sfrb    UMCTL0            = UMCTL0_;
#define UBR00_              (0x0074)  /* UART 0 Baud Rate 0 波特率选择寄存器0*/
sfrb    UBR00             = UBR00_;
#define UBR10_              (0x0075)  /* UART 0 Baud Rate 1 波特率选择寄存器1*/
sfrb    UBR10             = UBR10_;
#define RXBUF0_             (0x0076)  /* UART 0 Receive Buffer接收数据缓存 */
const sfrb RXBUF0         = RXBUF0_;
#define TXBUF0_             (0x0077)  /* UART 0 Transmit Buffer发送数据缓存 */
sfrb    TXBUF0            = TXBUF0_;

#define UCTL_0_             (0x0070)  /* UART 0 Control */
sfrb    UCTL_0            = UCTL_0_;
#define UTCTL_0_            (0x0071)  /* UART 0 Transmit Control */
sfrb    UTCTL_0           = UTCTL_0_;
#define URCTL_0_            (0x0072)  /* UART 0 Receive Control */
sfrb    URCTL_0           = URCTL_0_;
#define UMCTL_0_            (0x0073)  /* UART 0 Modulation Control */
sfrb    UMCTL_0           = UMCTL_0_;
#define UBR0_0_             (0x0074)  /* UART 0 Baud Rate 0 */
sfrb    UBR0_0            = UBR0_0_;
#define UBR1_0_             (0x0075)  /* UART 0 Baud Rate 1 */
sfrb    UBR1_0            = UBR1_0_;
#define RXBUF_0_            (0x0076)  /* UART 0 Receive Buffer */
const sfrb RXBUF_0        = RXBUF_0_;
#define TXBUF_0_            (0x0077)  /* UART 0 Transmit Buffer */
sfrb    TXBUF_0           = TXBUF_0_;

/************************************************************
* USART 1  通信模块1
************************************************************/

