sdlylshl/gprs_m22/src/msp430x14x头文件说明.h
/* Additional Timer B Control Register bits are defined in Timer A */

#define SLSHR1              (0x0400)  /* Compare latch load source 1 */
#define SLSHR0              (0x0200)  /* Compare latch load source 0 */
#define CLLD1               (0x0400)  /* Compare latch load source 1 */
#define CLLD0               (0x0200)  /* Compare latch load source 0 */

#define SLSHR_0             (0*0x0200)  /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1             (1*0x0200)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2             (2*0x0200)  /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3             (3*0x0200)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0              (0*0x0200)  /* Compare latch load sourec : 0 - immediate */
#define CLLD_1              (1*0x0200)  /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2              (2*0x0200)  /* Compare latch load sourec : 2 - up/down */
#define CLLD_3              (3*0x0200)  /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

/************************************************************
* Basic Clock Module   基本时钟模块
************************************************************/

#define DCOCTL_             (0x0056)  /* DCO Clock Frequency Control DCO时钟控制 */
sfrb    DCOCTL            = DCOCTL_;
#define BCSCTL1_            (0x0057)  /* Basic Clock System Control 1 基础时钟控制1*/
sfrb    BCSCTL1           = BCSCTL1_;
#define BCSCTL2_            (0x0058)  /* Basic Clock System Control 2 基础时钟控制2*/
sfrb    BCSCTL2           = BCSCTL2_;

#define MOD0                (0x01)   /* Modulation Bit 0 */
#define MOD1                (0x02)   /* Modulation Bit 1 */
#define MOD2                (0x04)   /* Modulation Bit 2 */
#define MOD3                (0x08)   /* Modulation Bit 3 */
#define MOD4                (0x10)   /* Modulation Bit 4 *//*MOD常数定义在32个DCO周期中插入的F(dco+1)周期，在余下的DCO周期中为F(dco)周期。*/
#define DCO0                (0x20)   /* DCO Select Bit 0 */
#define DCO1                (0x40)   /* DCO Select Bit 1 */
#define DCO2                (0x80)   /* DCO Select Bit 2 *//*DCO常数定义了选择8种频率之一，频率由注入DC发生器的电流定义*/

#define RSEL0               (0x01)   /* Resistor Select Bit 0 */
#define RSEL1               (0x02)   /* Resistor Select Bit 1 */
#define RSEL2               (0x04)   /* Resistor Select Bit 2 *//*由内部电阻选择8个频率之一*/
#define XT5V                (0x08)   /* XT5V should always be reset 必须复位*/
#define DIVA0               (0x10)   /* ACLK Divider 0 */
#define DIVA1               (0x20)   /* ACLK Divider 1 ，选择ACLK的分频数*/
#define XTS                 (0x40)   /* LFXTCLK 0:Low Freq. / 1: High Freq.选择LFXT1工作在低频晶振模式或高频晶振动模式，必须与外接的晶振符合 */
#define XT2OFF              (0x80)   /* Enable XT2CLK 控制XT2振荡器的开启可关闭*/

#define DIVA_0              (0x00)   /* ACLK Divider 0: /1 */
#define DIVA_1              (0x10)   /* ACLK Divider 1: /2 */
#define DIVA_2              (0x20)   /* ACLK Divider 2: /4 */
#define DIVA_3              (0x30)   /* ACLK Divider 3: /8 */

#define DCOR                (0x01)   /* Enable External Resistor : 1 */
#define DIVS0               (0x02)   /* SMCLK Divider 0 */
#define DIVS1               (0x04)   /* SMCLK Divider 1 */
#define SELS                (0x08)   /* SMCLK Source Select 0:DCOCLK / 1:XT2CLK/LFXTCLK */
#define DIVM0               (0x10)   /* MCLK Divider 0 */
#define DIVM1               (0x20)   /* MCLK Divider 1 */
#define SELM0               (0x40)   /* MCLK Source Select 0 */
#define SELM1               (0x80)   /* MCLK Source Select 1 */

#define DIVS_0              (0x00)   /* SMCLK Divider 0: /1 */
#define DIVS_1              (0x02)   /* SMCLK Divider 1: /2 */
#define DIVS_2              (0x04)   /* SMCLK Divider 2: /4 */
#define DIVS_3              (0x06)   /* SMCLK Divider 3: /8 */

#define DIVM_0              (0x00)   /* MCLK Divider 0: /1 */
#define DIVM_1              (0x10)   /* MCLK Divider 1: /2 */
#define DIVM_2              (0x20)   /* MCLK Divider 2: /4 */
#define DIVM_3              (0x30)   /* MCLK Divider 3: /8 */

#define SELM_0              (0x00)   /* MCLK Source Select 0: DCOCLK */
#define SELM_1              (0x40)   /* MCLK Source Select 1: DCOCLK */
#define SELM_2              (0x80)   /* MCLK Source Select 2: XT2CLK/LFXTCLK */
#define SELM_3              (0xC0)   /* MCLK Source Select 3: LFXTCLK */

/*************************************************************
* Flash Memory   FLASH芯片
*************************************************************/

#define FCTL1_              (0x0128)  /* FLASH Control 1 *///Flash存储器控制寄存器FCTL1
sfrw    FCTL1             = FCTL1_;
#define FCTL2_              (0x012A)  /* FLASH Control 2 *///Flash存储器控制寄存器FCTL2
sfrw    FCTL2             = FCTL2_;
#define FCTL3_              (0x012C)  /* FLASH Control 3 *///Flash存储器控制寄存器FCTL3
sfrw    FCTL3             = FCTL3_;
//FCTL1寄存器
#define FRKEY               (0x9600)  /* Flash key returned by read */
#define FWKEY               (0xA500)  /* Flash key for write */
#define FXKEY               (0x3300)  /* for use with XOR instruction */

#define ERASE               (0x0002)  /* Enable bit for Flash segment erase *///0：不擦除；1：允许擦除1段，段号由空写入指令的地址确定。擦除完成时，ERASE自动复位
#define MERAS               (0x0004)  /* Enable bit for Flash mass erase *///0：不擦除；1：允许擦除所有段，由主存空写入指令启动。擦除完成时MERAS自动复位。
#define WRT                 (0x0040)  /* Enable bit for Flash write *///编程的时候必须将它置位
#define BLKWRT              (0x0080)  /* Enable bit for Flash segment write *///段编程，0：未选择段编程方式；1：采用段编程，在两段的操作之间，需要作一次复位和置位
#define SEGWRT              (0x0080)  /* old definition */ /* Enable bit for Flash segment write *///段编程，0：未选择段编程方式；1：采用段编程，在两段的操作之间，需要作一次复位和置位
//FCTL2寄存器
#define FN0                 (0x0001)  /* Devide Flash clock by: 2^0 *///
#define FN1                 (0x0002)  /* Devide Flash clock by: 2^1 */
#define FN2                 (0x0004)  /* Devide Flash clock by: 2^2 */
#define FN3                 (0x0008)  /* Devide Flash clock by: 2^3 */
#define FN4                 (0x0010)  /* Devide Flash clock by: 2^4 */
#define FN5                 (0x0020)  /* Devide Flash clock by: 2^5 */   //FN0~~~FN5定义时钟源信号的分频因子，为1~64，FN值加1
#define FSSEL0              (0x0040)  /* Flash clock select 0 */        /* to distinguish from UART SSELx */
#define FSSEL1              (0x0080)  /* Flash clock select 1 */         //选择时钟源  0：ACLK；1：MCLK；2，3：SMCLK

#define FSSEL_0             (0x0000)  /* Flash clock select: 0 - ACLK */
#define FSSEL_1             (0x0040)  /* Flash clock select: 1 - MCLK */
#define FSSEL_2             (0x0080)  /* Flash clock select: 2 - SMCLK */
#define FSSEL_3             (0x00C0)  /* Flash clock select: 3 - SMCLK */
//FCTL3寄存器
#define BUSY                (0x0001)  /* Flash busy: 1 *///0：FLASH存储器不忙，由POR或时序发生器复位：1：FLASH存储器忙
#define KEYV                (0x0002)  /* Flash Key violation flag *///0：安全键值是0A5H；1：对寄存器1，2，3写入时安全键值不是0A5H，使得KEYV置位并引起PUC，KEYV不会自动复位，许软件复位
#define ACCVIFG             (0x0004)  /* Flash Access violation flag *///非法访问中断标志
#define WAIT                (0x0008)  /* Wait flag for segment write *///0：段编程已经开始，编程在进行中；1：段编程有效，当前数据编程完成，等待后续的编程数据
#define LOCK                (0x0010)  /* Lock bit: 1 - Flash is locked (read only) *///0：FLASH可以做读，编程，擦除及主存擦除等操作
#define EMEX                (0x0020)  /* Flash Emergency Exit *///用于FLASH擦除或者编程失控的情况。0：无作用；1：立即停止对FLASH的操作

/************************************************************
* Comparator A   比较器A
************************************************************/

